void main(List<String> args) {
  ///promotion data type
  ///به حالتی که دارت میاد مقدرا کمتر دقیق تر رو بعنوان یه مقدار دقیقتر در نظر میگیره تا اون مقدار رو بریزه داخل یک مقدار دقیقتر اصطلاحا promotion type میگویند
  //ما میتونیم نوع داده ایی که دقت کمتری داره مثل int > رو بریزیم داخل نوع داده ایی که دقت بیشتری داره
  //در واقع نوع داده ایی که کمتر دقیق تر هستش رو بعنوان نوع داده ایی دقیقتر در نظر میگیره
  // مثل double > ولی برعکسش امکان پذیر نیست
  //در مثال زیر ما اومدیم نوع داده ایی اعداد صحیح رو با اعداد اعشاری مقایسه کردیم که نمونهایی از نوع داده ایی promotion هست
  final double hasAge1 = 30; //data type is double..>30.0
  final hasAge2 = 30; //data type is int..>30
  //ارتقای یک عدد صحیح به یک عدد دابل با مشخص کردن نوع داده بدست امد
  print(hasAge1);
  print(hasAge2);

  /// invalid operation
  // final int herAge = 40.25;// در اینجا ما مجاز نیستیم نوع داده ایی صحیح(دقیقتر) رو بریزیم داخل نوع داده ایی کمتر دقیقتر(اعداد صحیح) در واقع اینجا داره تنزل رتبه اتفاق میافته و ما دنبال ارتقا نیستیم.
  // دواقع مقدار دقیقتر رو به مقدرا کمتر دقیقتر کاهش میدهیم و این عمل بطور پیش فرض در دارت مجاز نیست
}
